IDEA Open Model
CrossSectionFactory.FillCssRectangleHollow Method
Compatible with IDEA StatiCa 20.1
 Fill cross-section of shape rectangular for concrete sections
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillCssRectangleHollow(
	CrossSectionParameter cssO,
	double width,
	double height,
	double thickLeft,
	double thickRight,
	double thickTop,
	double thickBottom
)
Public Shared Sub FillCssRectangleHollow (
	cssO As CrossSectionParameter,
	width As Double,
	height As Double,
	thickLeft As Double,
	thickRight As Double,
	thickTop As Double,
	thickBottom As Double
)
Parameters
cssO
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
width
Type: System.Double
The width of css.
height
Type: System.Double
The height of css.
thickLeft
Type: System.Double
The thickness at the left side.
thickRight
Type: System.Double
The thickness at the rigth side.
thickTop
Type: System.Double
The thickness at the top.
thickBottom
Type: System.Double
The thickness at the bottom.
Return Value
Type:
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace